giulio1979/ESP32-BLE-Keyboard/BleKeyboard.cpp
  hid->reportMap((uint8_t*)_hidReportDescriptor, sizeof(_hidReportDescriptor));
  hid->startServices();

  onStarted(pServer);

  advertising = pServer->getAdvertising();
  advertising->setAppearance(HID_KEYBOARD);
  advertising->addServiceUUID(hid->hidService()->getUUID());
  advertising->setScanResponse(false);
  advertising->start();
  hid->setBatteryLevel(batteryLevel);

  ESP_LOGD(LOG_TAG, "Advertising started!");
}

void BleKeyboard::end(void)
{
}

bool BleKeyboard::isConnected(void) {
  return this->connected;
}

void BleKeyboard::setBatteryLevel(uint8_t level) {
  this->batteryLevel = level;
  if (hid != 0)
    this->hid->setBatteryLevel(this->batteryLevel);
}

//must be called before begin in order to set the name
void BleKeyboard::setName(std::string deviceName) {
  this->deviceName = deviceName;
}

//must be called before begin in order to set passkey
void BleKeyboard::setPasskey(uint32_t passkey) {
  this->passkey = passkey; 
  this->enable_passkey = 1;	
}
/**
 * @brief Sets the waiting time (in milliseconds) between multiple keystrokes in NimBLE mode.
 * 
 * @param ms Time in milliseconds
 */
void BleKeyboard::setDelay(uint32_t ms) {
  this->_delay_ms = ms;
}

void BleKeyboard::set_vendor_id(uint16_t vid) { 
	this->vid = vid; 
}

void BleKeyboard::set_product_id(uint16_t pid) { 
	this->pid = pid; 
}

void BleKeyboard::set_version(uint16_t version) { 
	this->version = version; 
}

void BleKeyboard::sendReport(KeyReport* keys)
{
  if (this->isConnected())
  {
    this->inputKeyboard->setValue((uint8_t*)keys, sizeof(KeyReport));
    this->inputKeyboard->notify();
#if defined(USE_NIMBLE)        
    // vTaskDelay(delayTicks);
    this->delay_ms(_delay_ms);
#endif // USE_NIMBLE
  }	
}

void BleKeyboard::sendReport(MediaKeyReport* keys)
{
  if (this->isConnected())
  {
    this->inputMediaKeys->setValue((uint8_t*)keys, sizeof(MediaKeyReport));
    this->inputMediaKeys->notify();
#if defined(USE_NIMBLE)        
    //vTaskDelay(delayTicks);
    this->delay_ms(_delay_ms);
#endif // USE_NIMBLE
  }	
}

extern
const uint8_t _asciimap[128] PROGMEM;

#define SHIFT 0x80
#define ALTGR 0x40


#define SHIFT 0x80
const uint8_t _asciimap[128] =
{
	0x00,             // NUL
	0x00,             // SOH
	0x00,             // STX
	0x00,             // ETX
	0x00,             // EOT
	0x00,             // ENQ
	0x00,             // ACK
	0x00,             // BEL
	0x2a,			// BS	Backspace
	0x2b,			// TAB	Tab
	0x28,			// LF	Enter
	0x00,             // VT
	0x00,             // FF
	0x00,             // CR
	0x00,             // SO
	0x00,             // SI
	0x00,             // DEL
	0x00,             // DC1
	0x00,             // DC2
	0x00,             // DC3
	0x00,             // DC4
	0x00,             // NAK
	0x00,             // SYN
	0x00,             // ETB
	0x00,             // CAN
	0x00,             // EM
	0x00,             // SUB
	0x00,             // ESC
	0x00,             // FS
	0x00,             // GS
	0x00,             // RS
	0x00,             // US

	0x2c,		   //  ' '
	0x1e|SHIFT,	   // !
	0x34|SHIFT,	   // "
	0x20|SHIFT,    // #
	0x21|SHIFT,    // $
	0x22|SHIFT,    // %
	0x24|SHIFT,    // &
	0x34,          // '
	0x26|SHIFT,    // (
	0x27|SHIFT,    // )
	0x25|SHIFT,    // *
	0x2e|SHIFT,    // +
	0x36,          // ,
	0x2d,          // -
	0x37,          // .
	0x38,          // /
	0x27,          // 0
	0x1e,          // 1
	0x1f,          // 2
	0x20,          // 3
	0x21,          // 4
	0x22,          // 5
	0x23,          // 6
	0x24,          // 7
	0x25,          // 8
	0x26,          // 9
	0x33|SHIFT,      // :
	0x33,          // ;
	0x36|SHIFT,      // <
	0x2e,          // =
	0x37|SHIFT,      // >
	0x38|SHIFT,      // ?
	0x1f|SHIFT,      // @
	0x04|SHIFT,      // A
	0x05|SHIFT,      // B
	0x06|SHIFT,      // C
	0x07|SHIFT,      // D
	0x08|SHIFT,      // E
	0x09|SHIFT,      // F
	0x0a|SHIFT,      // G
	0x0b|SHIFT,      // H
	0x0c|SHIFT,      // I
	0x0d|SHIFT,      // J
	0x0e|SHIFT,      // K
	0x0f|SHIFT,      // L
	0x10|SHIFT,      // M
	0x11|SHIFT,      // N
	0x12|SHIFT,      // O
	0x13|SHIFT,      // P
	0x14|SHIFT,      // Q
	0x15|SHIFT,      // R
	0x16|SHIFT,      // S
	0x17|SHIFT,      // T
	0x18|SHIFT,      // U
	0x19|SHIFT,      // V
	0x1a|SHIFT,      // W
	0x1b|SHIFT,      // X
	0x1c|SHIFT,      // Y
	0x1d|SHIFT,      // Z
	0x2f,          // [
	0x31,          // bslash
	0x30,          // ]
	0x23|SHIFT,    // ^
	0x2d|SHIFT,    // _
	0x35,          // `
	0x04,          // a
	0x05,          // b
	0x06,          // c
	0x07,          // d
	0x08,          // e
	0x09,          // f
	0x0a,          // g
	0x0b,          // h
	0x0c,          // i
	0x0d,          // j
	0x0e,          // k
	0x0f,          // l
	0x10,          // m
	0x11,          // n
	0x12,          // o
	0x13,          // p
	0x14,          // q
	0x15,          // r
	0x16,          // s
	0x17,          // t
	0x18,          // u
	0x19,          // v
	0x1a,          // w
	0x1b,          // x
	0x1c,          // y
	0x1d,          // z
	0x2f|SHIFT,    // {
	0x31|SHIFT,    // |
	0x30|SHIFT,    // }
	0x35|SHIFT,    // ~
	0				// DEL
};

extern
const uint8_t _asciimap_iso[256] PROGMEM;

const uint8_t _asciimap_iso[256] =
{
//0...
	0x00,             // NUL
	0x00,             // SOH
	0x00,             // STX
	0x00,             // ETX
	0x00,             // EOT
	0x00,             // ENQ
	0x00,             // ACK  
	0x00,             // BEL
	0x2a,			  // BS	Backspace
	0x2b,			  // TAB	Tab
//10...
	0x28,			  // LF	Enter
	0x00,             // VT 
	0x00,             // FF 
	0x00,             // CR 
	0x00,             // SO 
	0x00,             // SI 
	0x00,             // DEL
	0x00,             // DC1
	0x00,             // DC2
	0x00,             // DC3
//20...
	0x00,             // DC4
	0x00,             // NAK
	0x00,             // SYN
	0x00,             // ETB
	0x00,             // CAN
	0x00,             // EM 
	0x00,             // SUB
	0x00,             // ESC
	0x00,             // FS 
	0x00,             // GS 
//30...
	0x00,             // RS 
	0x00,             // US 
//32...
	0x2c,		   // 32 ' '
	0x1e|SHIFT,	   // !
	0x1f|SHIFT,	   // "
	0x31,          // #
	0x21|SHIFT,    // $
	0x22|SHIFT,    // %
	0x23|SHIFT,    // &
	0x31|SHIFT,    // '
//40...
	0x25|SHIFT,    // 40 (
	0x26|SHIFT,    // )
	0x30|SHIFT,    // *
	0x30,          // +
	0x36,          // ,
	0x38,          // -
	0x37,          // .
	0x24|SHIFT,    // /
	0x27,          // 48 0
	0x1e,          // 1
//50...
	0x1f,          // 50 2
	0x20,          // 3
	0x21,          // 4
	0x22,          // 5
	0x23,          // 6
	0x24,          // 7
	0x25,          // 8
	0x26,          // 9
	0x37|SHIFT,    // :
	0x36|SHIFT,    // ;
//60...
	0x03,          // 60 <
	0x27|SHIFT,    // =
	0x03|SHIFT,    // >
	0x2d|SHIFT,    // ?
	0x14|ALTGR,    // @
	0x04|SHIFT,    // 65 A
	0x05|SHIFT,    // B
	0x06|SHIFT,    // C
	0x07|SHIFT,    // D
	0x08|SHIFT,    // E
//70...
	0x09|SHIFT,    // 70 F
	0x0a|SHIFT,    // G
	0x0b|SHIFT,    // H
	0x0c|SHIFT,    // I
	0x0d|SHIFT,    // J
	0x0e|SHIFT,    // K
	0x0f|SHIFT,    // L
	0x10|SHIFT,    // M
	0x11|SHIFT,    // N
	0x12|SHIFT,    // O
//80...
	0x13|SHIFT,    // 80 P
	0x14|SHIFT,    // Q
	0x15|SHIFT,    // R
	0x16|SHIFT,    // S
	0x17|SHIFT,    // T
	0x18|SHIFT,    // U
	0x19|SHIFT,    // V
	0x1a|SHIFT,    // W
	0x1b|SHIFT,    // X
	0x1d|SHIFT,    // Y
//90...
	0x1c|SHIFT,    // 90 Z
	0x25|ALTGR,    // [
	0x2d|ALTGR,    // bslash
	0x26|ALTGR,    // ]
	0x35,          // ^
	0x38|SHIFT,    // _
	0x2e|SHIFT,    // `
	0x04,          // 97 a
	0x05,          // b
	0x06,          // c
//100...
	0x07,          // 100 d
	0x08,          // e
	0x09,          // f
	0x0a,          // g
	0x0b,          // h
	0x0c,          // i
	0x0d,          // j
	0x0e,          // k
	0x0f,          // l
	0x10,          // m
//110...
	0x11,          // 110 n
	0x12,          // o
	0x13,          // p
	0x14,          // q
	0x15,          // r
	0x16,          // s
	0x17,          // t
	0x18,          // u
	0x19,          // v
	0x1a,          // w
//120...
	0x1b,          // 120 x
	0x1d,          // y
	0x1c,          // z
	0x24|ALTGR,    // {
	0x03|ALTGR,    // |
	0x27|ALTGR,    // }
	0x30|ALTGR,    // 126 ~ (AltGr-+)
	0x2a,          // DEL
//128...
	0x00,             // NUL
	0x00,             // SOH
//130...
	0x00,             // STX
	0x00,             // ETX
	0x00,             // EOT
	0x00,             // ENQ
	0x00,             // ACK  
	0x00,             // BEL
	0x2a,			  // BS	Backspace
	0x2b,			  // TAB	Tab
	0x28,			  // LF	Enter
	0x00,             // VT 
//140...
	0x00,             // FF 
	0x00,             // CR 
	0x00,             // SO 
	0x00,             // SI 
	0x00,             // DEL
	0x00,             // DC1
	0x00,             // DC2
	0x00,             // DC3
	0x00,             // DC4
	0x00,             // NAK
//150...
	0x00,             // SYN
	0x00,             // ETB
	0x00,             // CAN
	0x00,             // EM 
	0x00,             // SUB
	0x00,             // ESC
	0x00,             // FS 
	0x00,             // GS 
	0x00,             // RS 
	0x00,             // US 
//160...
	0x2c|ALTGR,       // nobr
	0x1e|ALTGR|SHIFT, // ¡
	0x06|ALTGR,       // ¢
	0x20|ALTGR|SHIFT, // £
	0,                // currency sign
	0,                // yen sign
	0x03|ALTGR|SHIFT, // ¦
	0x20|SHIFT,       // §
	0x2f|ALTGR,       // "
	0,                // copy
//170...
	0,                // fem
	0,                // left pointing double angle
	0,                // not
	0,                // soft hyphen
	0,                // reg
	0,                // macron
	0x35|SHIFT,       // degree
	0,                // plus-minus
	0x1f|ALTGR,       // super2
	0x20|ALTGR,       // super3
//180...
	0x2e,             // acute ´
	0x10|ALTGR,       // micro µ
	0,                // pilcrow
	0,                // mid dot
	0,                // cedilla
	0,                // super1
	0,                // masc
	0,                // right pointing double angle
	0,                // quarter
	0,                // half
//190...
	0,                // 3 quarter
	0,                // inv questmark
	0,                // À
	0,                // Á
	0,                // Â
	0,                // Ã
	0x34|SHIFT,       // Ä
	0,                // ringA
	0,                // Æ
	0,                // Cedi
//200...
	0,                // È
	0,                // É
	0,                // Ê
	0,                // Ë
	0,                // Ì
	0,                // Í
	0,                // Î
	0,                // Ï
	0,                // Eth
	0,                // Ñ
//210...
	0,                // Ò
	0,                // Ó
	0,                // Ô
	0,                // Õ
	0x33|SHIFT,       // Ö
	0,                // mult
	0,                // Ø
	0,                // Ù
	0,                // Ú
	0,                // Û
//220...
	0x2f|SHIFT,       // Ü
	0,                // Ý
	0,                // Thorn
	0x2d,             // ß
	0,                // à
	0,                // á
	0,                // â
	0,                // ã
	0x34,             // ä
	0,                // å
//230...
	0,                // æ
	0,                // ç
	0,                // è
	0,                // é
	0,                // ê
	0,                // ë
	0,                // ì
	0,                // í
	0,                // î
	0,                // ï
//240...
	0,                // eth
	0,                // ñ
	0,                // ò
	0,                // ó
	0,                // ô
	0,                // õ
	0x33,             // ö
	0,                // div
	0,                // ø
	0,                // ù
//250	
	0,                // ú
	0,                // û
	0x2f,             // 252=0xfc ü
	0x08|ALTGR,       // euro € (Niels!, ALT+e)
	0,                // thorn
	0,                // ÿ
};

uint8_t USBPutChar(uint8_t c);

