giulio1979/ESP32-BLE-Keyboard/BleKeyboard.cpp
void BleKeyboard::onConnect(BLEServer* pServer) {
  this->connected = true;

#if !defined(USE_NIMBLE)

  BLE2902* desc = (BLE2902*)this->inputKeyboard->getDescriptorByUUID(BLEUUID((uint16_t)0x2902));
  desc->setNotifications(true);
  desc = (BLE2902*)this->inputMediaKeys->getDescriptorByUUID(BLEUUID((uint16_t)0x2902));
  desc->setNotifications(true);

#endif // !USE_NIMBLE

}

void BleKeyboard::onDisconnect(BLEServer* pServer) {
  this->connected = false;

#if !defined(USE_NIMBLE)

  BLE2902* desc = (BLE2902*)this->inputKeyboard->getDescriptorByUUID(BLEUUID((uint16_t)0x2902));
  desc->setNotifications(false);
  desc = (BLE2902*)this->inputMediaKeys->getDescriptorByUUID(BLEUUID((uint16_t)0x2902));
  desc->setNotifications(false);

  advertising->start();

#endif // !USE_NIMBLE
}

void BleKeyboard::onWrite(BLECharacteristic* me) {
  uint8_t* value = (uint8_t*)(me->getValue().c_str());
  (void)value;
  ESP_LOGI(LOG_TAG, "special keys: %d", *value);
}

void BleKeyboard::delay_ms(uint64_t ms) {
  uint64_t m = esp_timer_get_time();
  if(ms){
    uint64_t e = (m + (ms * 1000));
    if(m > e){ //overflow
        while(esp_timer_get_time() > e) { }
    }
    while(esp_timer_get_time() < e) {}
  }
}

// ****** UTF8-Decoder: convert UTF8-string to extended ASCII *******
static byte c1;  // Last character buffer
// Convert a single Character from UTF8 to Extended ASCII
// Return "0" if a byte has to be ignored
byte BleKeyboard::utf8ascii(byte ascii) {
    if ( ascii < 128 )   // Standard ASCII-set 0..0x7F handling  
    {
		c1 = 0; 
        return (ascii); 
    }

    // get previous input
    byte last = c1;   // get last char
    c1=ascii;         // remember actual character

    switch (last)     // conversion depending on first UTF8-character
    {
		case 0xC2:
			return  (ascii);
			break;
        case 0xC3:
			ascii = (ascii | 0xC0);
			// german umlaut handling
			switch (ascii)	// see http://kellykjones.tripod.com/webtools/ascii_utf8_table.html
			{
				case 0xbc: // uumlaut
					ascii = 0xfc;	// 252
					break;
				case 0xb6: // oumlaut
					ascii = 0xf6;	// 246
					break;
				case 0xe4: // aumlaut
					ascii = 0xe4;	// 228
					break;
				case 0x9f: // szett
					ascii = 0xdf;	// 223
					break;
				case 0x9c: // Uumlaut
					ascii = 0xdc;	// 220
					break;
				case 0x96: // Oumlaut
					ascii = 0xd6;	// 214
					break;
				case 0x84: // Aumlaut
					ascii = 0xc4;	// 196
					break;
				default:
					break;
			}
			return ascii;
			break;
        case 0x82:
			if (ascii == 0xac) {
				return (0xfd);       // special case Euro-symbol
			}
			break;
    }
    return  (0);  // otherwise: return zero, if character has to be ignored
}

// convert String object from UTF8 String to Extended ASCII
String BleKeyboard::utf8ascii(String s)
{       
	String r="";
	char c;

	for (int i=0; i<s.length(); i++)
	{
		c = utf8ascii(s.charAt(i));
		if (c!=0) {
			r+=c;
		}
	}

	return r;
}

// In Place conversion UTF8-string to Extended ASCII (ASCII is shorter!)
void BleKeyboard::utf8ascii(char* s)
{       
	int k=0;
	char c;

	for (int i=0; i<strlen(s); i++)
	{
		c = utf8ascii(s[i]);
		if (c!=0) {
		   s[k++]=c;
		}
	}
	s[k]=0;
}
